
create_clock -name 1500 -period 50 -waveform {0 750} [get_ports dco_clk]
set_input_transition -rise -min 154 -clock dco_clk [get_ports dco_clk]
set_input_transition -fall -min 155 -clock dco_clk [get_ports dco_clk]
set_input_transition -rise -max 156 -clock dco_clk [get_ports dco_clk]
set_input_transition -fall -max 157 -clock dco_clk [get_ports dco_clk]
set_input_delay  -min -rise 150 -clock dco_clk [get_ports dco_clk]
set_input_delay  -min -fall 151 -clock dco_clk [get_ports dco_clk]
set_input_delay  -max -rise 152 -clock dco_clk [get_ports dco_clk]
set_input_delay  -max -fall 153 -clock dco_clk [get_ports dco_clk]
create_clock -name 1600 -period 60 -waveform {0 960} [get_ports lfxt_clk]
set_input_transition -rise -min 155 -clock lfxt_clk [get_ports lfxt_clk]
set_input_transition -fall -min 156 -clock lfxt_clk [get_ports lfxt_clk]
set_input_transition -rise -max 157 -clock lfxt_clk [get_ports lfxt_clk]
set_input_transition -fall -max 158 -clock lfxt_clk [get_ports lfxt_clk]
set_input_delay  -min -rise 151 -clock lfxt_clk [get_ports lfxt_clk]
set_input_delay  -min -fall 152 -clock lfxt_clk [get_ports lfxt_clk]
set_input_delay  -max -rise 153 -clock lfxt_clk [get_ports lfxt_clk]
set_input_delay  -max -fall 154 -clock lfxt_clk [get_ports lfxt_clk]